#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() Тогда

		Если Не ЗначениеЗаполнено(Объект.ТипСУБД) Тогда
			Объект.ТипСУБД = Перечисления.ноТипыСУБД.MSSQL;
		КонецЕсли;

		Если Объект.КоличествоВременныхБаз = 0 Тогда
			Объект.КоличествоВременныхБаз = 5;
		КонецЕсли;

		Объект.ИспользоватьДляВременныхБаз = Истина;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти