#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() И Не ЗначениеЗаполнено(Объект.Состояние) Тогда
		Объект.Состояние = Перечисления.ноСостоянияВременныхБаз.Свободна;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	ЗаполнитьИмяБазыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КластерПриИзменении(Элемент)
	
	ЗаполнитьИмяБазыНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьБазу(Команда)

	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, НСтр("ru='Сначала запишите элемент.'"));
		Возврат;
	КонецЕсли;

	Результат = СоздатьБазуНаСервере();
	Если Не Результат.Успешно Тогда
		ПоказатьПредупреждение(, СтрЗаменить(НСтр("ru='Не удалось создать базу: %1'"), "%1", Результат.Описание));
		Возврат;
	КонецЕсли;

	ПоказатьОповещениеПользователя(Результат.Описание);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СоздатьБазуНаСервере()

	Возврат ноСозданиеБазы.СоздатьБазу(Объект.Ссылка);

КонецФункции

&НаСервере
Процедура ЗаполнитьИмяБазыНаСервере()
	
	Транслит = СтроковыеФункцииКлиентСервер.ТранслитерироватьСтроку(Объект.Description);
	
	Префикс = "";
	Если ЗначениеЗаполнено(Объект.Кластер) Тогда
		РеквизитыКластера = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Кластер, "ПрефиксИмениБазы");
		Префикс = СтроковыеФункцииКлиентСервер.ТранслитерироватьСтроку(РеквизитыКластера.ПрефиксИмениБазы);
	КонецЕсли;
	
	ИмяБазы = Транслит;
	Если Не ПустаяСтрока(Префикс) Тогда
		Если ПустаяСтрока(Транслит) Тогда
			ИмяБазы = Префикс;
		Иначе
			ИмяБазы = Префикс + "_" + Транслит;
		КонецЕсли;
	КонецЕсли;
	
	Объект.ИмяБазыНаСервере = ИмяБазы;
	
КонецПроцедуры

#КонецОбласти