#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() И Не ЗначениеЗаполнено(Объект.Состояние) Тогда
		Объект.Состояние = Перечисления.ноСостоянияВременныхБаз.Свободна;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьБазу(Команда)

	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, НСтр("ru='Сначала запишите элемент.'"));
		Возврат;
	КонецЕсли;

	Результат = СоздатьБазуНаСервере();
	Если Не Результат.Успешно Тогда
		ПоказатьПредупреждение(, СтрЗаменить(НСтр("ru='Не удалось создать базу: %1'"), "%1", Результат.Описание));
		Возврат;
	КонецЕсли;

	ПоказатьОповещениеПользователя(Результат.Описание);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СоздатьБазуНаСервере()

	Возврат ноСозданиеБазы.СоздатьБазу(Объект.Ссылка);

КонецФункции

#КонецОбласти